In [46]:
import pymysql
import pandas as pd

db = None
try:
  # DB 호스트 정보 입력
    db = pymysql.connect(
        host='localhost',
        user='root',
        password='Xodls215@',
        db='chatbot',
        charset='utf8'
    )
    print("DB 연결 성공")
    
    # 테이블 생성 sql 정의
    sql = '''
        CREATE TABLE tb_student (
        id int primary key auto_increment not null,
        name varchar(32),
        age int,
        address varchar(32)
    ) ENGINE=InnoDB DEFAULT CHARSET=utf8
    '''
    
    # 테이블 생성
    with db.cursor() as cursor:
        cursor.execute(sql)
        print("테이블 생성 완료")
    
except Exception as e:
    print(e) # 연결 실패 시 오류 출력
finally:
    if db is not None: # DB가 연결된 경우에만 접속 닫기 시도
        db.close()
    print("DB 연결 닫기 성공")

DB 연결 성공
테이블 생성 완료
DB 연결 닫기 성공

In [47]:
import pymysql
import pandas as pd

db = None
result_find = ''
results = []
try:
  # DB 호스트 정보 입력
    db = pymysql.connect(
        host='localhost',
        user='root',
        password='Xodls215@',
        db='chatbot',
        charset='utf8'
    )
    print("DB 연결 성공")
    
    students = [
        {'name':'Kei', 'age':36, 'address':'PUSAN'},
        {'name':'Tony', 'age':34, 'address':'PUSAN'},
        {'name':'Jaeyoo', 'age':39, 'address':'GWANGJU'},
        {'name':'Grace', 'age':28, 'address':'SEOUL'},
        {'name':'Jenny', 'age':27, 'address':'SEOUL'},
    ]
    for s in students:
        with db.cursor() as cursor:
            sql = '''
                insert tb_student(name, age, address) values("%s", "%d", "%s")
            ''' % (s['name'], s['age'], s['address'])
            cursor.execute(sql)
    db.commit()
    
    # 30대 학생만 조회
    cond_age = 30
    with db.cursor(pymysql.cursors.DictCursor) as cursor:
        sql = '''
            select * from tb_student where age > %d
        ''' % cond_age
        cursor.execute(sql)
        result_find = cursor.fetchall()
    print(result_find)
    
    # 이름 검색
    cond_name = 'Grace'
    with db.cursor(pymysql.cursors.DictCursor) as cursor:
        sql = '''
            select * from tb_student where name = "%s"
        ''' % cond_name
        cursor.execute(sql)
        results = cursor.fetchone()
    print("\n이름 검색 결과 -> 이름 : {} and 나이 : {}\n".format(results['name'], results['age']))
    
    # pandas dataframe으로 표현
    df = pd.DataFrame(results)
    print(df)
    
except Exception as e:
    print(e) # 연결 실패 시 오류 출력
finally:
    if db is not None: # DB가 연결된 경우에만 접속 닫기 시도
        db.close()
    print("DB 연결 닫기 성공")

DB 연결 성공
[{'id': 1, 'name': 'Kei', 'age': 36, 'address': 'PUSAN'}, {'id': 2, 'name': 'Tony', 'age': 34, 'address': 'PUSAN'}, {'id': 3, 'name': 'Jaeyoo', 'age': 39, 'address': 'GWANGJU'}]

이름 검색 결과 -> 이름 : Grace and 나이 : 28

If using all scalar values, you must pass an index
DB 연결 닫기 성공

In [56]:
df

   id    name  age  address
0   1     Kei   36    PUSAN
1   2    Tony   34    PUSAN
2   3  Jaeyoo   39  GWANGJU
3   6     Kei   36    PUSAN
4   7    Tony   34    PUSAN
5   8  Jaeyoo   39  GWANGJU
6  11     Kei   36    PUSAN
7  12    Tony   34    PUSAN
8  13  Jaeyoo   39  GWANGJU